groupmates =[
    {
        "name": "Анна",
        "surname": "Зайцева",
        "exams":["ПИС", "Философия", "БД"],
        "marks": [4, 3, 5]
    },
    {
        "name": "Николай",
        "surname": "Оголев",
        "exams": ["История", "АиГ", "КТП"],
        "marks":[5, 5, 5]
    },
    {
        "name": "Анна",
        "surname": "Сугробова",
        "exams": ["АИС", "БигДата", "Экономика"],
        "marks": [5, 5, 5]
    },
    {
        "name": "Данила",
        "surname": "Никитин",
        "exams":["АИС", "ИСИС", "ВЫшМат"],
        "marks": [5, 5, 5]
    },
    {
        "name": "Саргис",
        "surname": "Саргис",
        "exams": ["Философия", "БД", "КТП"],
        "marks": [3, 3, 3]
    }
]

def filter_students(student_list):
    # Просим ввести балл (вводить нужно через точку, например: 4.5)
    min_grade = float(input("Введите минимальный средний балл: "))
    
    print("\nПодходящие студенты:")
    
    # student - это один студент из списка (один словарь)
    for student in student_list:
        
        # Считаем средний балл: сумму всех оценок делим на их количество
        # sum() - сумма списка, len() - длина списка (количество элементов)
        average_mark = sum(student["marks"]) / len(student["marks"])
        
        # Если средний балл больше того, что ввел пользователь
        if average_mark > min_grade:
            # Печатаем имя, фамилию и посчитанный средний балл
            # Обращаемся к словарю по ключам (по названиям в кавычках)
            print(student["name"], student["surname"], "-", average_mark)

# Вызываем функцию
filter_students(groupmates)


